SELECT "核算单位名称",
         "子目名称",
         "科目名称",
         "子目代码",
         "币别",
         "期初金额",
         round(sum("本期借方"),
        2) AS "借方合计",
         round(sum("本期贷方"),
        2) AS "贷方合计",
         round("期初金额"+round(sum("本期借方"),
        2)-round(sum("本期贷方"),
        2),
        2)as"期末余额"
FROM '银行存款余额表1-10月'
WHERE "科目名称"="银行存款"
GROUP BY  "子目代码","币别"
UNION
SELECT "核算单位名称",
         "子目名称",
         "科目名称",
         "子目代码",
         "币别",
         "期初金额",
         round(sum("本期借方"),
        2) AS "借方合计",
         round(sum("本期贷方"),
        2) AS "贷方合计",
         round("期初金额"+round(sum("本期借方"),
        2)-round(sum("本期贷方"),
        2),
        2)as"期末余额"
FROM '银行存款余额表1-10月'
WHERE "科目名称"="其他货币资金"
GROUP BY  "子目代码","币别"
UNION
SELECT "核算单位名称",
         "子目名称",
         "科目名称",
         "子目代码",
         "币别",
         "期初金额",
         round(sum("本期借方"),
        2) AS "借方合计",
         round(sum("本期贷方"),
        2) AS "贷方合计",
         round("期初金额"+round(sum("本期借方"),
        2)-round(sum("本期贷方"),
        2),
        2)as"期末余额"
FROM '银行存款余额表1-10月'
WHERE "科目名称"="短期借款-进口押汇"
GROUP BY  "子目代码","币别"
UNION
SELECT "核算单位名称",
         "子目名称",
         "科目名称",
         "子目代码",
         "币别",
         "期初金额",
         round(sum("本期借方"),
        2) AS "借方合计",
         round(sum("本期贷方"),
        2) AS "贷方合计",
         round("期初金额"+round(sum("本期借方"),
        2)-round(sum("本期贷方"),
        2),
        2)as"期末余额"
FROM '银行存款余额表1-10月'
WHERE "科目名称"="短期借款-票据贴现"
GROUP BY  "子目代码","币别"
UNION
SELECT "核算单位名称",
         "子目名称",
         "科目名称",
         "子目代码",
         "币别",
         "期初金额",
         round(sum("本期借方"),
        2) AS "借方合计",
         round(sum("本期贷方"),
        2) AS "贷方合计",
         round("期初金额"+round(sum("本期借方"),
        2)-round(sum("本期贷方"),
        2),
        2)as"期末余额"
FROM '银行存款余额表1-10月'
WHERE "科目名称"="短期借款-银行贷款"
        OR "科目名称"="长期借款-银行贷款"
GROUP BY  "子目代码","币别"
UNION
SELECT "核算单位名称",
         "子目名称",
         "科目名称",
         "子目代码",
         "币别",
         "期初金额",
         round(sum("本期借方"),
        2) AS "借方合计",
         round(sum("本期贷方"),
        2) AS "贷方合计",
         round("期初金额"+round(sum("本期借方"),
        2)-round(sum("本期贷方"),
        2),
        2)as"期末余额"
FROM '银行存款余额表1-10月'
WHERE "科目名称"="长期借款-银行贷款"
GROUP BY  "子目代码","币别"